# QUIZ

*Q-1-What does the PostgreSQL RANGE() function do?

*A-1-->There is no RANGE() function in PostgreSQL.

*Q-2-->What does the NTIL() function do?
*A-2->It separates the data into equal groups.
The NTIL() function only creates groups with an equal number of rows. It does not evaluate tied values.

Q-3-->What is the mode of a data set?
A-3->>the value that occurs the most number of times


Be aware that the PostgreSQL MODE() function only returns one of these values if there are more than one with the same number of occurrences.


Q-4-->Which of these describes a continuous median?

A-4-->For datasets with an even number of data points, a continuous median will sort the data, then average the two middle values.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
# connection string: driver://username:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:password@localhost/two_three')

### MEDIAN value of dataset

In [2]:
pd.read_sql_query('select * from public.people_heights', engine).head(3)

   person_id    name  height_inches gender
0          1  Sophia          65.50      f
1          2   Kelly          64.30      m
2          3     Dee          73.75      m

In [3]:
#Discrete median:percentile_disc
#Continous median:percentile_cont
pd.read_sql_query(
        '''
    select gender,
        percentile_disc(0.5) within group (order by height_inches) as "discrete median",
        percentile_cont(0.5) within group (order by height_inches) as "continuous median"
    from public.people_heights
    group by rollup (gender);

        ''', engine).head(10)

  gender  discrete median  continuous median
0      f            64.20             64.240
1      m            69.38             69.385
2   None            66.74             66.740

In [12]:
#quartiles-->ntile(4) quartlie 4 create 4 groups 
pd.read_sql_query(
        '''
    select
percentile_cont(.25) within group (order by height_inches) as "1st quartile",
percentile_cont(.50) within group (order by height_inches) as "2nd quartile",
percentile_cont(.75) within group (order by height_inches) as "3rd quartile"
from public.people_heights;

-- WARNING: the ntile() function only creates even groups,
--          not statistical quartiles

select name, height_inches,ntile(4) over (order by height_inches)
from public.people_heights
order by height_inches;


        ''', engine).head(10)

        name  height_inches  ntile
0   Jaquelyn          57.34      1
1    Juliane          57.71      1
2       Anna          57.79      1
3     Carley          58.08      1
4     Gracie          58.08      1
5       Shea          58.16      1
6        Wen          58.59      1
7    Doretta          59.13      1
8  Victorina          59.17      1
9      Tandy          59.59      1

In [13]:
#MODE,occurance
pd.read_sql_query(
        '''
        select
        mode() within group (order by height_inches)
        from public.people_heights;

select height_inches, count(*)
from public.people_heights
group by height_inches
order by count(*) desc;

             ''', engine).head(10)

   height_inches  count
0          66.17      3
1          69.56      3
2          68.76      3
3          65.29      2
4          68.05      2
5          71.95      2
6          64.28      2
7          66.74      2
8          65.41      2
9          66.66      2

In [17]:
#RANGE

pd.read_sql_query('''

select 
gender,
count(gender),
max(height_inches) - min(height_inches) as "height range"
from public.people_heights
group by rollup (gender);
    
    
    ''', engine).head(10)

  gender  count  height range
0   None    400         19.53
1      m    200         15.28
2      f    200         16.49

## challenge

***use inventory.products to explore the two_three olive oil product pricing***

*Display the min,max,first quartile,secon quartile,and third quartile;and range of prices*

*use grouping function and ordered sets to obtain the requested inforation*

In [18]:
pd.read_sql_query('select * from inventory.products', engine).head(3)

      sku product_name  category_id  size  price
0  ALB008     Delicate            1     8  10.99
1  ALB032     Delicate            1    32  18.99
2  ALB064     Delicate            1    64  22.99

In [27]:

pd.read_sql_query('''
        SELECT  category_id,
                MIN(price),
                MAX(price),
                percentile_cont(.25) within group (order by price) as "1st quartile",
                percentile_cont(.50) within group (order by price) as "2nd quartile",
                percentile_cont(.75) within group (order by price) as "3rd quartile",
                max(price) - min(price) as "Range price"
                
        FROM inventory.products
        Group by ROLLUP (category_id);

    ''', engine).head(10)

,category_id,min,max,1st quartile,2nd quartile,3rd quartile,Range price
0,1.0,8.99,27.99,12.99,18.99,22.99,19.0
1,2.0,8.99,19.99,11.99,14.99,16.99,11.0
2,3.0,6.99,21.99,8.99,12.99,16.99,15.0
3,NaN,6.99,27.99,12.99,16.99,22.99,21.0